namespace Them05_Task03
{
    internal class Program
    {
        static void Main()
        {
            //Сформировать одномерный массив из 10 случайных чисел из диапазона [0, 50].
            //Найти и вывести значение максимального, минимального элементов и их индексы.
            Console.WriteLine("Hello, World!");
        }
    }
}
