namespace Theme06_Task03
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //Нужно создать отчёт, который будет содержать информацию о продажах за определённый период.Отчёт должен быть отформатирован следующим образом:
            //Название отчёта: "Отчёт о продажах за [месяц] [год]".
            //Информация о продажах:
            //Общая сумма продаж.
            //Количество проданных товаров.
            //Средняя стоимость одного товара.
            //Общая сумма продаж должна быть отформатирована как денежная величина (с разделителями тысяч и двумя знаками после запятой).
            //Средняя стоимость товара должна быть округлена до двух знаков после запятой.

        }
    }
}
