namespace Theme07_Task02
{
    internal class Program
    {
        static void Main(string[] args)
        {
            /* Создайте метод CalcCube для вычисления объема и площади поверхности куба по длине его ребра.
             * Метод должен иметь 3 параметра - длина ребра, out-параметр для объема
             * и out-параметр для площади поверхности.
            */
            Console.WriteLine("Hello, World!");
        }
    }
}
