namespace Them05_Task02
{
    internal class Program
    {
        static void Main()
        {
            //Сформировать одномерный массив из 10 случайных чисел из диапазона[-20, 20].
            //Определить количество положительных, отрицательных и равных нулю элементов.

            Console.WriteLine("Hello, World!");
        }
    }
}
