namespace Theme14_Task02
{
//    Разработайте программу для управления складом магазина электроники, используя коллекцию Dictionary<string, int>, где:
//    Ключ — артикул товара(например, "A001")
//    Значение — количество единиц товара на складе
//Требования:
//    Создайте словарь и добавьте в него 3 товара:
//        Ноутбуки("A001") — 10 шт.
//        Смартфоны("B205") — 25 шт.
//        Наушники("C307") — 15 шт.
//    Реализуйте следующие операции:
//        Проверьте наличие товара с артикулом "B205" (ContainsKey).
//        Обновите количество ноутбуков до 8 (продали 2 шт.) через индексатор.
//        Получите количество наушников безопасным способом (TryGetValue).
//        Увеличьте количество смартфонов на 5 (новый завоз).
//        Удалите наушники из инвентаря (Remove).
//    Выведите текущий инвентарь в формате:
//       Артикул: A001, Количество: 8  
//       Артикул: B205, Количество: 30  
//    Проверьте, пуст ли словарь (Count), затем полностью очистите инвентарь (Clear).
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}
