namespace Theme09_Task01
{
    internal class Program
    {
        static void Main(string[] args)
        /* Угол задан с помощью целочисленных значений: gradus - градусов, min - угловых минут, sec - угловых секунд. 
         * Реализовать класс, в котором указанные значения представлены в виде свойств.
         * Для свойств предусмотреть проверку корректности данных.
         * Класс должен содержать конструктор для установки начальных значений,
         * а также метод ToRadians для перевода угла в радианы.
         * Создать объект на основе разработанного класса. 
         * Осуществить использование объекта в программе.
         */
        {
            Console.WriteLine("Hello, World!");
        }
    }
}
