namespace Theme14_Task01
{
// Разработайте программу для управления списком игроков команды, используя стандартные методы класса List<T>.
// Требования:
//  Создайте список для хранения фамилий игроков(тип string).
//  Реализуйте следующие операции:
//   Добавление игроков "Иванов", "Петров", "Сидоров" методом Add.
//   Вставка игрока "Козлов" на позицию с индексом 1 методом Insert.
//   Проверка наличия игрока "Петров" в команде методом Contains.
//   Удаление игрока "Сидоров" методом Remove.
//   Поиск индекса игрока "Козлов" методом IndexOf.
//   Сортировка списка по алфавиту методом Sort.
//   Выведите текущий состав команды в формате:
//     1. Иванов
//     2. Козлов
//     3. Петров
//   Проверьте, пуст ли список (свойство Count), и очистите его методом Clear.
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}
