namespace Theme07_Task04
{
    internal class Program
    {
        static void Main(string[] args)
        {
            /* Напишите метод FindMax, который принимает переменное количество чисел 
             * и возвращает максимальное значение. Используйте ключевое слово params.
            */

            Console.WriteLine("Hello, World!");
        }
    }
}
