namespace Theme07_Task03
{
    internal class Program
    {
        static void Main(string[] args)
        {
            /* Напишите метод PrintNumbers, который выводит на экран числа из массива. 
             * У метода должен быть необязательный параметр reverse,
             * который по умолчанию равен false. Если reverse равен true, числа выводятся в обратном порядке.
            */
            Console.WriteLine("Hello, World!");
        }
    }
}
